doc.tex
% Created 2017-12-06 Wed 11:10
\documentclass{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Jakub Zárybnický}
\date{\today}
\title{Cost Efficiency versus Quality of Service in Autoscaling Web Services}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.3.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
QoS vs cost efficiency

Minimum average queue time vs minimum cost (and some hard constraints,
e.g. queue time < 10ms)

The problem that I've chosen to focus on is this: How to provide maximum service
availability while being as cost-efficient as possible? The platform that I
assume is a web-service that uses a simple high-availability solution: a single
load-balancer, behind which there are several replicas (or instances) of the
application server. Having a running replica costs money (a fixed cost per
second, as is common in big cloud service providers), and we're trying to
minimize our costs while providing a good user experience.

There may be some hard constraints imposed on the simulation - e.g. the maximum number
of replicas may be limited (by the cloud provider or by the company's CFO), we
may have a specific hard upper limit on the quality, etc.

I've chosen to represent quality-of-service as the time spent in the queue while
waiting before a request starts being processed. This disregards a number of
factors - the time spent processing a request, the time spent waiting for the
database, \ldots{} These factors will be included as a random variable, but to
simplify the model, I won't specify them in detail - as simulating e.g. database
congestion or data consistency is a large topic, and I'll focus on replica
scaling.

Analytic solution of this system would be possible, but with my current
mathematical knowledge, I'd have difficulties representing it in its entirety.

The 'solution' we're looking for here are three parameters: minimum active
replicas, maximum active replicas, and the auto-scaler thresholds.

Inspiration:
The topic of this work was inspired by my personal experiences and several
interesting problems in my day job. Most of the information presented in the
Analysis section were things that I've slowly accumulated over my IT career, and
any references that I'd find would be retrospective. Nonetheless, I've attempted
to back non-conceptual facts by references.

\url{https://www.researchgate.net/publication/261759640_A_queuing_theory_model_for_cloud_computing}
solves a similar problem, focusing on different parameters.

\url{http://ieeexplore.ieee.org/document/6194446/} solves a similar problem using
analytical methods.

Facts:
\begin{itemize}
\item we assume that the number of replicas that we can potentially use is
unlimited - in practice, the number will be very high, but limited - but this
fact is unimportant, as I expect that in most simulations, we'll have a fixed
cap on the number of replicas
\item replica start time - in practice, this is a number that depends on the type of
machine that we use - spinning up a physical server may take 45s
(\url{https://serverfault.com/questions/179714/fastest-time-to-get-an-ec2-instance-running}),
starting a full virtualized machine half that (as the hardware is already
running), starting a simple Docker container takes less then 0.5s on my
machine (as the kernel used is already running), and starting a worker process
is nearly instantaneous.
\item replica shutdown time - instantaneous, as we disconnect a replica before
shutting it down.
\item client timeout - most web browsers use very large timeouts on the order of minutes
(\url{https://stackoverflow.com/questions/5798707/browser-timeouts}), so apart from
a few simulations, I won't be using timeouts
\item quality of service - a very wide term, in this model, I'll be using it to mean
the time spent in replica queue
\item we are interested only in the time spent in the queue, not in TTFB, database
congestion (this is a big topic to model, depends on db model (single-process
vs eventual consistency vs slow+immediate consistency)), nor processor utilization
\item auto-scaler properties - variable. The auto-scaler is a (meta)process that
starts and stops replicas based on the utilization of the system. It attempts
to keep the system to an ideal utilization (a parameter), constrained by a
minimum and maximum of replica amount. It needs to take into account the
start-up and shut-down time as well. I'll simulate the auto-scaler as a
periodic event that looks at the utilization (used vs total capacity) of the
available replicas.
\item request processing time - this is an arbitrary value. To simulate
different request types, I'll use a variable-time delay (switching between
several values based on their probability).
\item assumption - single-threaded machines. This is an unrealistic assumption, as
modern web servers are capable of handling hundreds of thousands of requests
per second (e.g. \url{http://www.aosabook.org/en/posa/warp.html}), but it simplifies
simulation quite a bit (as it would require e.g. an array of Stores). However,
as we're interested in queue times and not e.g. TTFB (time-to-first-byte) or
load times, this affects especially start-up and shut-down time factors, as in
real-life auto-scalers, it's CPU utilization that's the deciding factor, and
not the amount of free sockets. This simulation then most closely represents
modern single-threaded servers (e.g. Node.js), but even they use select, epoll
or kqueue to add quasi-parallelism. From another point-of-view, this could
also represent OS worker processes (not green threads), as used by e.g. Nginx.
\item assumption - zero replica failure. As the simulation time frame is not very
long and the reliability guaranteed cloud providers ranges from 98\% to 99.999\%
(e.g. \url{https://www.forpsicloud.cz/vseobecne-podminky.aspx}), we can safely
disregard this factor without much impact on the results.
\item assumption - ideal load balancer. In practice, high-availability (HA) is
implemented as a combination of HA DNS servers that direct users to several
(possibly geographically separated) load balancers, which then distribute
traffic among several web-servers
(e.g. \url{https://www.digitalocean.com/community/tutorials/how-to-configure-dns-round-robin-load-balancing-for-high-availability}). I
assume an ideal load balancer that works without hardware failures, and
that forwards requests instantaneously.
\item a simplification that could be removed if I used another approach - all
requests share a single queue. If I didn't rely on the single Store for
time-based statistics and if I manually updated a single TStat object, I could
use a vector/array/\ldots{} of Facilities (or perhaps of Stores to even simulate
multiprocessing capabilities).
\end{itemize}

Experimenting:

Several auto-scaler settings: one replica only (baseline), ten replicas,
auto-scaling with a target of 50\% utilization (45\% and 55\% thresholds),
auto-scaling with a target of 80\% utilization (75\% and 85\% thresholds).

Several request generators: linear generator generates requests using a static
exponential distribution; burst generator generates bursts of requests using an
exponential distribution as well - one burst is an evenly spaced sequence of
requests; varying-intensity generator uses an exponential distribution as well,
but the mean time between requests oscillates between two values (a fixed-size
step after every request).
