doc.tex

\section{Úvod}
\label{sec-1}
Úvod musí vysvětlit, proč se celá práce dělá a proč má uživatel výsledků váš
dokument číst (prosím, projekt sice děláte pro získání zápočtu v IMS, ale mohou
existovat i jiné důvody). Případně, co se při čtení dozví.

Například:

v této práci je řešena implementace \ldots{}, která bude použita pro sestavení modelu
\ldots{}  na základě modelu a simulačních experimentů bude ukázáno chování systému
\ldots{} v podmínkách \ldots{}  smyslem experimentů je demonstrovat, že pokud by \ldots{}, pak
by \ldots{}

Poznámka: u vyžádaných zpráv se může uvést, že zpráva vznikla na základě
požadavku \ldots{} (u školní práce takto zdůvod'novat projekt ovšem nelze, že). Je
velmi praktické zdůvodnit, v čem je práce náročná a proto přínos autora
nepopiratelný (např. pro zpracování modelu bylo nutno nastudovat \ldots{}, zpracovat,
\ldots{} model je ve svém oboru zajímavý/ojedinělý v \ldots{}).

grafy mají své náležitosti - identifikační název grafu (případně jeho číslo),
cejchované osy s názvem veličiny na dané ose (včetně její jednotky). V případě
grafu kombinujícího více jevů i legenda dokumentující grafické vyjádření jevů v
grafu.

veškeré tabulky a grafy musí být komentovány v textu - čtenáři musí
řečeno, co v tom grafu uvidí a čeho si má všimnout.

\subsection{Kdo se na práci podílel jako autor, odborný konzultant, dodavatel odborných faktů, význačné zdroje literatury/fakt, \ldots{}}
\label{sec-1-1}
je ideální, pokud jste vaši koncepci konzultovali s nějakou autoritou v oboru (v
IMS projektu to je hodnoceno, ovšem není vyžadováno)

pokud nebudete mít odborného konzultanta, nevadí. Nelze ovšem tvrdit, že jste
celé dílo vymysleli s nulovou interakcí s okolím a literaturou.
\subsection{V jakém prostředí a za jakých podmínek probíhalo experimentální ověřování validity modelu}
\label{sec-1-2}
pokud čtenář/zadavatel vaší zprávy neuvěří ve validitu vašeho modelu, obvykle
vaši práci odmítne už v tomto okamžiku.

\section{Rozbor tématu a použitých metod/technologií}
\label{sec-2}
Shrnutí všech podstatných faktů, které se týkají zkoumaného systému (co možná
nejvěcnějším a technickým (ideálně formálně matematickým) přístupem, žádné
literární příběhy).

Podstatná fakta o systému musí být zdůvodněna a podepřena důvěryhodným zdrojem
(vědecký článek, kniha, osobní měření a zjišťování). Pokud budete tvrdit, že
ovce na pastvě sežere dvě kila trávy za den, musí existovat jiný (důvěryhodný)
zdroj, který to potvrdí.

Toto shrnutí určuje míru důvěryhodnosti vašeho modelu (nikdo nechce výsledky z
nedůvěryhodného modelu). Pokud nebudou uvedeny zdroje faktů o vašem systému,
hrozí ztráta bodů.

\subsection{Popis použitých postupů pro vytvoření modelu a zdůvodnění, proč jsou pro zadaný problém vhodné.}
\label{sec-2-1}
Zdůvodnění může být podpořeno ukázáním alternativního přístupu a srovnáním s tím
vaším. Čtenář musí mít jistotu, že zvolené nástroje/postupy/technologie jsou
ideální pro řešení zadaného problému (ovšem, "dělám to v Javě, protože
momentálně Java frčí\ldots{}" nemusí zadavatele studie uspokojit).

\subsection{Popis původu použitých metod/technologií}
\label{sec-2-2}
(odkud byly získány (odkazy), zda-li jsou vytvořeny autorem) - převzaté části
dokumentovat (specificky, pokud k nim přísluší nějaké autorské
oprávnění/licence).

Zdůvodnit potřebu vytvoření vlastních metod/nástrojů/algoritmů. Ve většině
případů budete přebírat již navržené metody/algoritmy/definice/nástroje a je to
pro školní projekt typické. Stejně tak je typické, že studenti chybně vymýšlí
již hotové věci a dojdou k naprostému nesmyslu - je třeba toto nebezpečí
eleminovat v tomto zdůvodnění.

Velmi důležité, až fanaticky povinné, kontrolované a hodnocené: na každém místě
v textu, kde se poprvé objeví pojem z předmětu IMS bude v závorce uveden odkaz
na předmět a číslo slajdu, na kterém je pojem definován. Pokud bude významný
pojem z předmětu IMS takto nedokumentován v textu a zjevně bude používán
nevhodným nebo nepřesným způsobem, bude tento fakt hodnocen bodovou
ztrátou. Tento požadavek je míněn s naprostou vážností.

Cílem je vyhnout se studentské tvůrčí činnosti ve vysvětlování známých pojmů,
což mnohdy vede k naprostým bludům, ztrátě bodů a zápočtů. Pokud student pojem
cituje korektně a přesto nekorektně používá, bude to hodnoceno dvojnásobnou
bodovou ztrátou.

\section{Koncepce}
\label{sec-3}
Konceptuální model je abstrakce reality a redukce reality na soubor relevantních
faktů pro sestavení simulačního modelu. Předpokládáme, že model bude obsahovat
fakta z "Rozboru tématu". Pokud jsou některá vyřazena nebo modifikována, je nuto
to zde zdůvodnit (například: zkoumaný subjekt vykazuje v jednom procentu případů
toto chování, ovšem pro potřeby modelu je to naprosto marginální a smíme to
zanedbat, neboť \ldots{}).

Pokud některé partie reality zanedbáváte nebo zjednodušujete, musí to být
zdůvodněno a v ideálním případě musí být prokázáno, že to neovlivní validitu
modelu. Cílem konceptuálního (abstraktního) modelu je formalizovat relevantní
fakta o modelovaném systému a jejich vazby. Podle koncept. modelu by měl být
každý schopen sestavit simulační model.

\subsection{Způsob vyjádření konceptuálního modelu musí být zdůvodněn}
\label{sec-3-1}
(na obrázku xxx je uvedeno schéma systému, v rovnicích xx-yy jsou popsány vazby
mezi \ldots{}, způsob synchronizace procesů je na obrázku xxx s Petriho sítí).

\subsection{Formy konceptuálního modelu}
\label{sec-3-2}
Podle potřeby uveďte konkrétní relevantní:
\begin{itemize}
\item obrázek/náčrt/schéma/mapa (možno čitelně rukou)
\item matematické rovnice - u některých témat (např. se spojitými prvky,
optimalizace, \ldots{}) naprosto nezbytné. Dobré je chápat, že veličiny (fyzikální,
technické, ekonomické) mají jednotky, bez kterých údaj nedává smysl.
\item stavový diagram (konečný automat) nebo Petriho síť - spíše na abstraktní
úrovni. Petriho síť nemá zobrazovat výpočty a přílišné detaily. Pokud se
pohodlně nevejde na obrazovku, je nepoužitelná. Možno rozdělit na bloky se
zajímavými detaily a prezentovat odděleně abstraktní celek a podrobně
specifikované bloky (hierarchický přístup).
\end{itemize}

Popište abstraktně architekturu vašeho programu, princip jeho činnosti, významné
datové struktury a podobně. Smyslem této kapitoly je podat informaci o programu
bez použití názvů tříd, funkcí a podobně.

Tuto kapitolu by měl pochopit každý technik i bez informatického
vzdělání. Vyjadřovacími prostředky jsou vývojové diagramy, schémata, vzorce,
algoritmy v pseudokódu a podobně. Musí zde být vysvětlena nosná myšlenka vašeho
přístupu.

\section{Architektura simulačního modelu}
\label{sec-4}
Tato kapitola má různou důležitost pro různé typy zadání. U implementačních
témat lze tady očekávat jádro dokumentace. Zde můžete využít zajímavého prvku ve
vašem simulačním modelu a tady ho "prodat".

Minimálně je nutno ukázat mapování abstraktního (koncept.) modelu do simulačního
(resp. simulátoru). Např. které třídy odpovídají kterým procesům/veličinám a
podobně.

\section{Podstata simulačních experimentů a jejich průběh}
\label{sec-5}
Nezaměňujte pojmy testování a experimentování (důvod pro bodovou ztrátu)!!!

Zopakovat/shrnout co přesně chcete zjistit experimentováním a proč k tomu
potřebujete model. Pokud experimentování nemá cíl, je celý projekt špatně.

Je celkem přípustné u experimentu odhalit chybu v modelu, kterou na základě
experimentu opravíte. Pokud se v některém experimentu nechová model podle
očekávání, je nutné tento experiment důkladně prověřit a chování modelu
zdůvodnit (je to součást simulačnické profese).

Pokud model pro některé vstupy nemá důvěryhodné výsledky, je nutné to
zdokumentovat. Pochopitelně model musí mít důvěryhodné výsledky pro většinu
myslitelných vstupů.

\subsection{Naznačit postup experimentování}
\label{sec-5-1}
jakým způsobem hodláte prostřednictvím experimentů dojít ke svému cíli (v
některých situacích je přípustné "to zkoušet tak dlouho až to vyjde", ale i ty
musí mít nějaký organizovaný postup).
