doc.org
** Dokumentace jednotlivých experimentů
souhrn vstupních podmínek a podmínek běhu simulace, komentovaný výpis výsledků,
závěr experimentu a plán pro další experiment (např. v experimentu 341. jsem
nastavil vstup x na hodnotu X, která je typická pro ... a vstup y na Y, protože
chci zjistit chování systému v prostředi ... Po skončení běhu simulace byly
získány tyto výsledky ..., kde je nejzajímavější hodnota sledovaných veličin
a,b,c které se chovaly podle předpokladu a veličin d,e,f které ne. Lze z toho
usoudit, že v modelu není správně implementováno chování v podmínkách ... a
proto v následujících experimentech budu vycházet z modifikovaného modelu verze
... Nebo výsledky ukazují, že systém v těchto podmínkách vykazuje značnou
citlivost na parametr x ... a proto bude dobré v dalších experimentech přesně
prověřit chování systému na parametr x v intervalu hodnot ... až ...)

** Závěry experimentů
bylo provedeno N experimentů v těchto situacích ... V průběhu experimentování
byla odstraněna ... chyba v modelu. Z experimentů lze odvodit chování systémů s
dostatečnou věrohodností a experimentální prověřování těchto ... situací již
napřinese další výsledky, neboť ...

* Shrnutí simulačních experimentů a závěr
Závěrem dokumentace se rozumí zhodnocení simulační studie a zhodnocení
experimentů (např. Z výsledků experimentů vyplývá, že ... při předpokladu, že
... Validita modelu byla ověřena ... V rámci projektu vznikl nástroj ..., který
vychází z ... a byl implementován v ...).

do závěru se nehodí psát poznámky osobního charakteru (např. práce na projektu
mě bavila/nebavila, ...). Technická zpráva není osobní příběh autora.

absolutně nikoho nezajímá, kolik úsilí jste projektu věnovali, důležitá je pouze
kvalita zpracování simulátoru/modelu a obsažnost simulační studie (rozhodně ne
např.: projekt jsem dělal ... hodin, což je víc než zadání
předpokládalo. Program má ... řádků kódu). Pokud zdůrazňujete, že jste práci
dělali významně déle než se čekalo, pak tím pouze demonstrujete vlastní
neschopnost (to platí zejména v profesním životě).

do závěru se velmi nehodí psát "auto-zhodnocení" kvality práce, to je výhradně
na recenzentovi/hodnotiteli (např. v projektu jsem zcela splnil zadání a
domnívám se, že můj model je bezchybný a výsledky taktéž). Statisticky častý je
pravý opak autorova auto-zhodnocení. Pokud přesto chcete vyzdvihnout kvalitu
svého díla (což je dobře), tak vaše výroky musí být naprosto nepopiratelně
zdůvodněny a prokázány (např. pomocí jiného referenčního přístupu, matematického
důkazu, analýzy, ...).
